# ####################################################################

#  Created by Encounter(R) RTL Compiler RC14.27 - v14.20-s064_1 on Wed Nov 30 20:16:56 +0300 2022

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design Integrator

create_clock -name "clk" -add -period 50.0 -waveform {0.0 25.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_wire_load_selection_group "4_metls_routing" -library "D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C"
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LGCN_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LGCN_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LGCN_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LGCP_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LGCP_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LGCP_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LSGCN_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LSGCN_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LSGCN_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LSGCP_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LSGCP_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LSGCP_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LSOGCN_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LSOGCN_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LSOGCN_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LSOGCP_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LSOGCP_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/LSOGCP_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/STE_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/STE_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/STE_5VX3]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/STE_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/ST_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/ST_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/ST_5VX3]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/ST_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/ANTENNACELLN2_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/ANTENNACELLN5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/ANTENNACELLNP2_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/ANTENNACELLP2_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/ANTENNACELLP5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/DECAP5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/DECAP7_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/DECAP10_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/DECAP15_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/DECAP25_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE2_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE3_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE4_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE6_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE7_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE8_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE9_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE10_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE11_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE12_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE13_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE14_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE15_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE16_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE17_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE18_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE19_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE20_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE21_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE22_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE23_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE24_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE25_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE26_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE27_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE28_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE29_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE30_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE31_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNE32_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED6_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED7_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED8_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED9_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED10_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED11_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED12_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED13_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED14_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED15_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED16_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED17_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED18_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED19_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED20_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED21_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED22_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED23_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED24_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED25_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED26_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED27_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED28_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED29_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED30_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED31_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FCNED32_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FEED1_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FEED2_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FEED3_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FEED5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FEED7_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FEED10_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FEED15_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/FEED25_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/SIGNALHOLD_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/MPROBEBU_5VX8]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_fast_3_60V_m40C/MPROBE_5V]
set_clock_uncertainty -hold 1.0 [get_ports clk]
set_clock_uncertainty -setup 1.0 [get_ports clk]
