# ####################################################################

#  Created by Encounter(R) RTL Compiler RC14.27 - v14.20-s064_1 on Fri Nov 25 23:41:45 +0300 2022

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design Integrator

create_clock -name "clk" -add -period 50.0 -waveform {0.0 25.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_wire_load_selection_group "4_metls_routing" -library "D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C"
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LGCN_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LGCN_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LGCN_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LGCP_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LGCP_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LGCP_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LSGCN_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LSGCN_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LSGCN_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LSGCP_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LSGCP_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LSGCP_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LSOGCN_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LSOGCN_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LSOGCN_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LSOGCP_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LSOGCP_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/LSOGCP_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/STE_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/STE_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/STE_5VX3]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/STE_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/ST_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/ST_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/ST_5VX3]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/ST_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/ANTENNACELLN2_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/ANTENNACELLN5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/ANTENNACELLNP2_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/ANTENNACELLP2_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/ANTENNACELLP5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/DECAP5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/DECAP7_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/DECAP10_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/DECAP15_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/DECAP25_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE2_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE3_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE4_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE6_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE7_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE8_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE9_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE10_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE11_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE12_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE13_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE14_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE15_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE16_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE17_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE18_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE19_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE20_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE21_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE22_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE23_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE24_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE25_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE26_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE27_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE28_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE29_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE30_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE31_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNE32_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED6_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED7_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED8_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED9_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED10_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED11_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED12_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED13_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED14_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED15_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED16_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED17_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED18_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED19_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED20_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED21_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED22_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED23_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED24_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED25_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED26_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED27_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED28_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED29_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED30_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED31_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FCNED32_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FEED1_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FEED2_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FEED3_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FEED5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FEED7_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FEED10_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FEED15_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/FEED25_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/SIGNALHOLD_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/MPROBEBU_5VX8]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_slow_3_00V_175C/MPROBE_5V]
set_clock_uncertainty -hold 1.0 [get_ports clk]
set_clock_uncertainty -setup 1.0 [get_ports clk]
