### Project name: Integrator
### Author: Phan Van Chien
### Technology: X-FAB 180nm CMOS, XT018 1243
### Library: D_CELLS_5V, 3.3 V
### File description: SDC Constraint 


#***********************************************************************************
# Time Information
#***********************************************************************************
set_units -time 1.0ns;	
set_units -capacitance 1.0pF;	
#***********************************************************************************
# Create Clock
#*********************************************************************************** 		
create_clock -name {clk} -period 50.000 -waveform { 0.000 25.000 } [get_ports {clk}]
#***********************************************************************************
# Set Clock Uncertainty
#***********************************************************************************
set_clock_uncertainty -hold 5 [get_ports {clk}] 
set_clock_uncertainty -setup 5 [get_clocks {clk}]  
#***********************************************************************************


