## VERSION "Version 17.0.0 Build 595 09/25/2022 SJ Standard Edition"		
## DATE    "Wed SEPTEMBER 10 14:03:25 2022"  		
##
## DEVICE  "INTEGRATOR"
##
#***********************************************************************************
# Time Information
#***********************************************************************************
set_units -time 1.0ns;	
set_units -capacitance 1.0pF;	
#***********************************************************************************
# Create Clock
#*********************************************************************************** 		
create_clock -name {clk} -period 50.000 -waveform { 0.000 25.000 } [get_ports {clk}]
#***********************************************************************************
# Set Clock Uncertainty
#***********************************************************************************
set_clock_uncertainty -rise_from [get_clocks {clk}] -rise_to [get_clocks {clk}]  5 
set_clock_uncertainty -rise_from [get_clocks {clk}] -fall_to [get_clocks {clk}]  5  
set_clock_uncertainty -fall_from [get_clocks {clk}] -rise_to [get_clocks {clk}]  5  
set_clock_uncertainty -fall_from [get_clocks {clk}] -fall_to [get_clocks {clk}]  5  
#***********************************************************************************
# Set Clock Transition
#***********************************************************************************
set_clock_transition -rise -min 2  [get_clocks clk]
set_clock_transition -rise -max 2 [get_clocks clk]
set_clock_transition -fall -min 2  [get_clocks clk]
set_clock_transition -fall -max 2 [get_clocks clk]
#***********************************************************************************
# Delay Definition
#***********************************************************************************
set_input_delay -clock [get_clocks clk] -add_delay 3 [get_ports clk_enable]
set_input_delay -clock [get_clocks clk] -add_delay 3 [get_ports reset]
set_output_delay -clock [get_clocks clk] -add_delay 3 [get_ports ce_out]
set_max_capacitance 0.5 [all_outputs]

